# Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# x = int(input('Введите значение предиката X, где 0 - это ложь, а 1- истина: '))
# y = int(input('Введите значение предиката Y, где 0 - это ложь, а 1- истина: '))
# z = int(input('Введите значение предиката Z, где 0 - это ложь, а 1- истина: '))
# print(not(x or y or z) == (not x and not y and not z))

x = int(input('Введите значение предиката X, где 0 - это ложь, а 1- истина: '))
y = int(input('Введите значение предиката Y, где 0 - это ложь, а 1- истина: '))
z = int(input('Введите значение предиката Z, где 0 - это ложь, а 1- истина: '))
if not(x or y or z) == (not x and not y and not z):
    print('Утверждение истинно')
else:
    print('Утверждение ложно')

