# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет,
# является ли этот день выходным.
#
# Пример:
#
# - 6 -> да
# - 7 -> да
# - 1 -> нет

day_of_the_week = int(input('Введите цифру обозначающую день недели: '))
if 5 < day_of_the_week < 8:
    print(f'{day_of_the_week} - выходной')
elif 0 < day_of_the_week < 6:
    print(f'{day_of_the_week} - будний день')
else:
    print(f'{day_of_the_week} - не является днем недели')
